app/controllers/school_classes_controller.rb

    def show
        @c = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        c = SchoolClass.create(params_class)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["room_number", 2], ["created_at", "2020-02-25 02:17:05.732873"], ["updated_at", "2020-02-25 02:17:05.732873"]]

    def edit
        @c = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        c = SchoolClass.find(params[:id])
        c.update(params_class)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 5], ["updated_at", "2020-02-25 02:22:47.738465"], ["id", 1]]